CSI API ETABS v1
cSapModel.GetModelFilename Method
 Returns a string that represents the filename of the current model, with or without the full path.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
string GetModelFilename(
	bool IncludePath = true
)
Function GetModelFilename (
	Optional IncludePath As Boolean = true
) As String
Dim instance As cSapModel
Dim IncludePath As Boolean
Dim returnValue As String
returnValue = instance.GetModelFilename(IncludePath)
String^ GetModelFilename(
	bool IncludePath = true
)
abstract GetModelFilename :
        ?IncludePath : bool
(* Defaults:
        let _IncludePath = defaultArg IncludePath true
*)
-> string
Parameters
IncludePath (Optional)
Type: System.Boolean
 A boolean (True or False) value. When this item is True, the returned filename includes the full path where the file is located.
Return Value
Type: String
 Returns a string that represents the filename of the current model, with or without the full path.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'save the model
       ret = SapModel.File.Save("C:\CSI_API_temp\API_1-001.edb")
   'display the filename of the model
       MsgBox(SapModel.GetModelFilename())
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace